In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.arange(0, 25).reshape(5, 5)
arr

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [3]:
df = pd.DataFrame(arr, columns=['V', 'W', 'X', 'Y', 'Z'], 
                  index=['A', 'B', 'C', 'D', 'E'])

In [4]:
df.head()

    V   W   X   Y   Z
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [5]:
df['W']

A     1
B     6
C    11
D    16
E    21
Name: W, dtype: int64

## Conditional Selection

In [6]:
df['W'] % 2 == 0

A    False
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [7]:
df[df['W'] % 2 == 0]

    V   W   X   Y   Z
B   5   6   7   8   9
D  15  16  17  18  19

In [8]:
(df['W'] % 2 == 0) & (df['W'] % 3 == 0)

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [9]:
df[(df['W'] % 2 == 0) & (df['W'] % 3 == 0)]

   V  W  X  Y  Z
B  5  6  7  8  9

In [10]:
df[(df['W'] % 2 == 0) | (df['W'] % 3 == 0)]

    V   W   X   Y   Z
B   5   6   7   8   9
D  15  16  17  18  19
E  20  21  22  23  24

In [11]:
students = pd.DataFrame({'Name':['ABC', 'DEF', 'GHI', 'JKL'], 
                         'Marks':[100, 25, 50, 30]})

students

  Name  Marks
0  ABC    100
1  DEF     25
2  GHI     50
3  JKL     30

In [12]:
students[students['Marks'] > 33]['Name']

0    ABC
2    GHI
Name: Name, dtype: object

## Adding & Removing Columns

In [13]:
students['Gender'] = ['M', 'F', 'F', 'M']
students

  Name  Marks Gender
0  ABC    100      M
1  DEF     25      F
2  GHI     50      F
3  JKL     30      M

In [14]:
students.drop('Gender', axis=1, inplace=True)

In [15]:
students

  Name  Marks
0  ABC    100
1  DEF     25
2  GHI     50
3  JKL     30

## Missing Values

In [16]:
df = pd.DataFrame({'A':[1, 2, np.nan], 'B':[np.nan, np.nan, 5],
                  'C':[10, 20, 30]})
df

     A    B   C
0  1.0  NaN  10
1  2.0  NaN  20
2  NaN  5.0  30

In [17]:
df.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [18]:
df.dropna(axis=1)

    C
0  10
1  20
2  30

In [19]:
df.fillna('FILL')

      A     B   C
0     1  FILL  10
1     2  FILL  20
2  FILL     5  30

In [20]:
df.fillna(df.mean())

     A    B   C
0  1.0  5.0  10
1  2.0  5.0  20
2  1.5  5.0  30

## Unique Values

In [21]:
students

  Name  Marks
0  ABC    100
1  DEF     25
2  GHI     50
3  JKL     30

In [23]:
students['Gender'] = ['M', 'F', 'F', 'M']
students

  Name  Marks Gender
0  ABC    100      M
1  DEF     25      F
2  GHI     50      F
3  JKL     30      M

In [24]:
students['Gender'].unique()

array(['M', 'F'], dtype=object)

In [25]:
students['Name'].unique()

array(['ABC', 'DEF', 'GHI', 'JKL'], dtype=object)

In [26]:
students['Gender'].nunique()

2

In [27]:
students['Gender'].value_counts()

M    2
F    2
Name: Gender, dtype: int64

## Grouping

In [28]:
students

  Name  Marks Gender
0  ABC    100      M
1  DEF     25      F
2  GHI     50      F
3  JKL     30      M

In [30]:
students['Section'] = ['A', 'B', 'A', 'C']
students

  Name  Marks Gender Section
0  ABC    100      M       A
1  DEF     25      F       B
2  GHI     50      F       A
3  JKL     30      M       C

In [31]:
students['Marks'].mean()

51.25

In [32]:
students['Marks'].sum()

205

In [33]:
students['Marks'].min()

25

In [34]:
students['Marks'].max()

100

In [35]:
students.groupby('Section')

In [36]:
students.groupby('Section').mean()

         Marks
Section
A           75
B           25
C           30

## Custom Functions

In [37]:
students

  Name  Marks Gender Section
0  ABC    100      M       A
1  DEF     25      F       B
2  GHI     50      F       A
3  JKL     30      M       C

In [40]:
def times10(value):
    return value + 10

In [41]:
students['Marks'].apply(times10)

0    110
1     35
2     60
3     40
Name: Marks, dtype: int64

In [42]:
students['Marks'].apply(lambda value : value + 10)

0    110
1     35
2     60
3     40
Name: Marks, dtype: int64

## Reading from External File

In [44]:
df = pd.read_csv('usedcars_dataset.csv')

In [45]:
df.head()

,symboling,normalized-losses,make,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,length,...,highway-mpg,price,city-L/100km,highway-L/100km,price_binned,diesel,gas,normalized_length,normalized_width,normalized_height
0,3,NaN,alfa-romero,std,two,convertible,rwd,front,88.6,168.8,...,27,13495,11.190476,8.703704,Low,0,1,-0.438315,-0.851335,-2.029015
1,3,NaN,alfa-romero,std,two,convertible,rwd,front,88.6,168.8,...,27,16500,11.190476,8.703704,Low,0,1,-0.438315,-0.851335,-2.029015
2,1,NaN,alfa-romero,std,two,hatchback,rwd,front,94.5,171.2,...,26,16500,12.368421,9.038462,Low,0,1,-0.243544,-0.185134,-0.558319
3,2,164.0,audi,std,four,sedan,fwd,front,99.8,176.6,...,30,13950,9.791667,7.833333,Low,0,1,0.194690,0.147966,0.217881
4,2,164.0,audi,std,four,sedan,4wd,front,99.4,176.6,...,22,17450,13.055556,10.681818,Low,0,1,0.194690,0.243137,0.217881

In [46]:
df['make']

0      alfa-romero
1      alfa-romero
2      alfa-romero
3             audi
4             audi
          ...
196          volvo
197          volvo
198          volvo
199          volvo
200          volvo
Name: make, Length: 201, dtype: object

In [47]:
df['make'].unique()

array(['alfa-romero', 'audi', 'bmw', 'chevrolet', 'dodge', 'honda',
       'isuzu', 'jaguar', 'mazda', 'mercedes-benz', 'mercury',
       'mitsubishi', 'nissan', 'peugot', 'plymouth', 'porsche', 'renault',
       'saab', 'subaru', 'toyota', 'volkswagen', 'volvo'], dtype=object)